---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.IfcApplicationName
source: html/6169fc78-5ab7-6f6d-6885-5172e3de7e7e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.IfcApplicationName Property

"IfcApplicationName"

## Syntax (C#)
```csharp
public static ForgeTypeId IfcApplicationName { get; }
```